espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/mipi_dsi_bridge_eco5_struct.h
/** Group: Version Register */
/** Type of ver_date register
 *  version control register
 */
typedef union {
    struct {
        /** ver_data : R/W; bitpos: [31:0]; default: 539296009;
         *  Represents csv version
         */
        uint32_t ver_data:32;
    };
    uint32_t val;
} dsi_brg_ver_date_reg_t;


typedef struct {
    volatile dsi_brg_clk_en_reg_t clk_en;
    volatile dsi_brg_en_reg_t en;
    volatile dsi_brg_dma_req_cfg_reg_t dma_req_cfg;
    volatile dsi_brg_raw_num_cfg_reg_t raw_num_cfg;
    volatile dsi_brg_raw_buf_credit_ctl_reg_t raw_buf_credit_ctl;
    volatile dsi_brg_fifo_flow_status_reg_t fifo_flow_status;
    volatile dsi_brg_pixel_type_reg_t pixel_type;
    volatile dsi_brg_dma_block_interval_reg_t dma_block_interval;
    volatile dsi_brg_dma_req_interval_reg_t dma_req_interval;
    volatile dsi_brg_dpi_lcd_ctl_reg_t dpi_lcd_ctl;
    volatile dsi_brg_dpi_rsv_dpi_data_reg_t dpi_rsv_dpi_data;
    uint32_t reserved_02c;
    volatile dsi_brg_dpi_v_cfg0_reg_t dpi_v_cfg0;
    volatile dsi_brg_dpi_v_cfg1_reg_t dpi_v_cfg1;
    volatile dsi_brg_dpi_h_cfg0_reg_t dpi_h_cfg0;
    volatile dsi_brg_dpi_h_cfg1_reg_t dpi_h_cfg1;
    volatile dsi_brg_dpi_misc_config_reg_t dpi_misc_config;
    volatile dsi_brg_dpi_config_update_reg_t dpi_config_update;
    uint32_t reserved_048[2];
    volatile dsi_brg_int_ena_reg_t int_ena;
    volatile dsi_brg_int_clr_reg_t int_clr;
    volatile dsi_brg_int_raw_reg_t int_raw;
    volatile dsi_brg_int_st_reg_t int_st;
    volatile dsi_brg_host_bist_ctl_reg_t host_bist_ctl;
    volatile dsi_brg_host_trigger_rev_reg_t host_trigger_rev;
    volatile dsi_brg_blk_raw_num_cfg_reg_t blk_raw_num_cfg;
    volatile dsi_brg_dma_frame_interval_reg_t dma_frame_interval;
    volatile dsi_brg_mem_aux_ctrl_reg_t mem_aux_ctrl;
    volatile dsi_brg_rdn_eco_cs_reg_t rdn_eco_cs;
    volatile dsi_brg_rdn_eco_low_reg_t rdn_eco_low;
    volatile dsi_brg_rdn_eco_high_reg_t rdn_eco_high;
    volatile dsi_brg_host_ctrl_reg_t host_ctrl;
    volatile dsi_brg_mem_clk_ctrl_reg_t mem_clk_ctrl;
    volatile dsi_brg_dma_flow_ctrl_reg_t dma_flow_ctrl;
    volatile dsi_brg_raw_buf_almost_empty_thrd_reg_t raw_buf_almost_empty_thrd;
    volatile dsi_brg_yuv_cfg_reg_t yuv_cfg;
    volatile dsi_brg_phy_lp_loopback_ctrl_reg_t phy_lp_loopback_ctrl;
    volatile dsi_brg_phy_hs_loopback_ctrl_reg_t phy_hs_loopback_ctrl;
    volatile dsi_brg_phy_loopback_cnt_reg_t phy_loopback_cnt;
    uint32_t reserved_0a0[24];
    volatile dsi_brg_ver_date_reg_t ver_date;
} dsi_brg_dev_t;

extern dsi_brg_dev_t MIPI_DSI_BRIDGE;

#ifndef __cplusplus
_Static_assert(sizeof(dsi_brg_dev_t) == 0x104, "Invalid size of dsi_brg_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
